SCF/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;  // Match your p-file format
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];  // Concentration units (kg/m³ or ppm)

internalField   uniform 0;  // Initialize with zero concentration

boundaryField
{
    inletOutlet
    {
        type            inletOutlet;  // Allows pollution to exit but not enter
        inletValue      uniform 0;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;  // Free atmosphere boundary
    }
    Buildings
    {
        type            zeroGradient;  // No deposition on buildings
    }
    Water
    {
        type            zeroGradient;  // No absorption by water
    }
    Terrain
    {
        type            zeroGradient;  // No ground deposition
    }
    Vegetation
    {
        type            zeroGradient;  // No absorption by vegetation
    }
}
// ************************************************************************* //