SCF/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            semiImplicitSource;

        timeStart       0;
        duration        100000000;

        selectionMode   cellZone;
        cellZone        pollutionZone;

        volumeMode      absolute;

        sources
        {
            C
            {
                explicit    0.00148323; // kg/s
                implicit    0;
            }
        }
    }

    massSource2
    {
        type            semiImplicitSource;
        active          true;

        timeStart       0;
        duration        100000000;

        selectionMode   cellZone;
        cellZone        pollutionZone2;

        volumeMode      absolute;

        sources
        {
            C
            {
                explicit    0.001659805; // kg/s for road2
                implicit    0;
            }
        }
    }

}



// ************************************************************************* //