SCF/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    actuationDisk1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box  (581850.5 4785805 1061) (581850.8 4785815 1071);
        }
    }
    {
        name    actuationDisk1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set  actuationDisk1CellSet;
        }
    }

    // actuationDisk2
    {
        name    actuationDisk2CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box  (581754 4785658 1065) (581754.4 4785668 1075);
        }
    }
    {
        name    actuationDisk2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set  actuationDisk2CellSet;
        }
    }

    {
        name    pollutionZoneCells;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/road_1.stl";
            nearDistance    1.0;
            curvature       0.1;  // Add this line - typical value is 0.1
            outsidePoints   ((-188.2 -75.29 634.24));
            includeCut      true;
            includeInside   true;
            includeOutside  false;
        }
    }

    {
        name    pollutionZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set pollutionZoneCells;
        }
    }

    {
        name    pollutionZoneCells2;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/road_2.stl";
            nearDistance    1.0;
            curvature       0.1;
            outsidePoints   ((-188.2 -75.29 634.24)); // adapt if needed
            includeCut      true;
            includeInside   true;
            includeOutside  false;
        }
    }

    {
        name    pollutionZone2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     pollutionZoneCells2;
        }
    }

);
// ************************************************************************* //